app/views/tasks/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h4>Tweet publicado por</h4>
<%= User.find(@task.user_id).email %> <%=@task.created_at.to_formatted_s(:short)%>