app/controllers/api/v1/api_controller.rb

            def process_token
                if request.headers['Authorization'].present?

                    begin
                        jwt_payload = JWT.decode(request.headers['Authorization'].split(" ")[0], Rails.application.secret_key_base).first
                        @current_user_id = jwt_payload['id']
                    rescue JWT::ExpiredSignature, JWT::VerificationError, JWT::DecodeError => error
                        #render json: {error: error.message}
                        render json: {error: "Token erronea"}, status: 401
                    end
                    unless(User.jwt_revoked?(jwt_payload, User.find(jwt_payload['id'])))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]