app/controllers/api/v1/sessions_controller.rb

            def create
                user = User.find_by_email(user_params[:email])

                if user && user.valid_password?(user_params[:password])
                  user.update_column(:jti, User.generate_jti)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@hotmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "jti" = ? WHERE "users"."id" = ?  [["jti", "6f0dec30-589e-473e-88cf-a6aec6e42856"], ["id", 5]]

            def respond_with(resource, _opts = {})

                user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@hotmail.com"], ["LIMIT", 1]]

            def respond_to_on_destroy

                if request.headers['Authorization'].present?
                        begin
                            jwt_payload = JWT.decode(request.headers['Authorization'].split(' ')[0], Rails.application.secret_key_base).first
                            @current_user_id = jwt_payload['id']
                            User.revoke_jwt(jwt_payload, User.find(@current_user_id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]