app/controllers/api/v1/task_controller.rb

            def create
              @task=Task.new(task_params)
              @task.user_id = @current_user_id
              # TODO: Implement auth
              if @task.save
---
INSERT INTO "tasks" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Prueba 1"], ["user_id", 1], ["created_at", "2021-04-28 17:36:59.322803"], ["updated_at", "2021-04-28 17:36:59.322803"]]

            def destroy
              if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 10]]

            def set_task
              begin
                @task=Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]