app/controllers/api/v1/tasks_controller.rb

            def create
              @task=Task.new(task_params)
              @task.user_id = User.first.id
              # TODO: Implement auth
              if @task.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "tasks" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Prueba"], ["user_id", 5], ["created_at", "2021-03-30 21:37:44.113714"], ["updated_at", "2021-03-30 21:37:44.113714"]]