app/controllers/tasks_controller.rb

  def create
    @task=Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Hola Lola"], ["user_id", 1], ["created_at", "2021-03-28 18:57:59.966778"], ["updated_at", "2021-03-28 18:57:59.966778"]]